// 영광의 신비 기도문 데이터

class GloriousMysteries {
  static const String title = '영광의 신비';

  static const List<Map<String, String>> mysteries = [
    {
      'title': '영광의 신비 1단',
      'subtitle': '예수님께서 부활하심을 묵상합시다.',
      'content': '''지극히 영예로우신 어머니 마리아님, 주님께서 부활하신 영광스러운 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
돌아가시고 묻히신 지 사흘째 되는 날 아침, 주님께서는 부활하시어 사랑하올 어머니께 나타나심으로서 형언할 수 없는 기쁨으로 어머니의 마음을 채워 드렸습니다. 또한 여인들과 제자들에게 나타나셔서 온 누리가 부활하신 주 하느님을 찬미하도록 하셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 만발한 장미 송이로 엮어 만든 이 꽃다발을 굳은 믿음의 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '영광의 신비 2단',
      'subtitle': '예수님께서 승천하심을 묵상합시다.',
      'content': '''지극히 영예로우신 어머니 마리아님, 주님께서 승천하신 영광스러운 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 부활하신 후 사십 일 동안 지상에 머무르시다가, 때가 되자 어머니와 제자들에게 둘러싸여 올리브 산으로 올라가 그곳에서 승천하시기 전 최후의 흠숭과 찬미를 받으셨습니다. 그때 예수님께서는 세상 끝날까지 항상 함께 계시겠다고 약속하시며, 못으로 뚫린 손을 그들 위에 펴시면서 마지막 강복을 주시고는 어머니와 제자들이 보는 앞에서 하늘로 올라가셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 만발한 장미 송이로 엮어 만든 이 꽃다발을 영원한 생명을 갈망하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '영광의 신비 3단',
      'subtitle': '예수님께서 성령을 보내심을 묵상합시다.',
      'content': '''지극히 영예로우신 어머니 마리아님, 성령 강림의 영광스러운 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
제자들이 어머니와 함께 예루살렘 다락방에 모여 있을 때, 성령의 불꽃이 혀의 모양으로 내려와 제자들의 마음을 거룩한 사랑으로 불타게 하시고, 그들에게 모든 진리를 깨우쳐 주시며 말씀의 은혜를 내려 주셨습니다.그리고 풍성한 은총으로 성령에 이끌린 어머니의 기도와 사도들을 통하여 인류 구원을 위한 교회 활동을 시작하셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 만발한 장미 송이로 엮어 만든 이 꽃다발을 하느님의 말씀을 전하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '영광의 신비 4단',
      'subtitle': '예수님께서 마리아를 하늘에 불러 올리심을 묵상합시다.',
      'content': '''지극히 영예로우신 어머니 마리아님, 주님께서 어머니를 하늘에 불러 올리신 영광스러운 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 어머니를 향한 지극한 사랑에서, 하늘에 계신 아드님과 일치할 소망에 불타는 어머니의 거룩한 영혼과 당신의 첫 감실이셨던 어머니의 순결한 육신을, 천사들과 성인들의 환호 가운데 하늘로 불러 올리셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 만발한 장미 송이로 엮어 만든 이 꽃다발을 어머니와 함께 예수님과 일치하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '영광의 신비 5단',
      'subtitle': '예수님께서 마리아께 천상 모후의 관을 씌우심을 묵상합시다.',
      'content': '''지극히 영예로우신 어머니 마리아님, 주님께서 어머니께 천상 모후의 관을 씌우신 영광스러운 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
천상으로 불러 올림을 받으신 어머니께서는 하느님의 사랑받는 딸, 성자의 존귀한 어머니, 성령의 선택된 짝으로서 하늘의 존엄한 삼관 여왕이 되셨습니다. 당신은 성삼위 하느님을 흠없이 찬미하신 복되신 어머니로서 저희의 간청을 전해 주실 가장 힘 있고 자비하신 분이시니, 어머니, 이 모든 기도를 하느님께 전구해 주소서.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 만발한 장미 송이로 엮어 만든 이 꽃다발을 성교회의 평화를 위해 기도하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
  ];
}
