// 환희의 신비 기도문 데이터

class JoyfulMysteries {
  static const String title = '환희의 신비';

  static const List<Map<String, String>> mysteries = [
    {
      'title': '환희의 신비 1단',
      'subtitle': '마리아께서 예수님을 잉태하심을 묵상합니다.',
      'content': '''어지신 어머니 마리아님, 예수님을 잉태하신 기쁨의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
가브리엘 천사가 당신께서 하느님의 어머니가 되시리라는 소식을 가지고 나타나 "은총이 가득한 이여 기뻐하여라, 주님께서 너와 함께 계시다" 라고 장엄한 인사를 드렸을때, 어머니께서는 "보십시오, 저는 주님의 종입니다. 말씀하신대로 저에게 이루어지기를 바랍니다." 라고 응답하시어 하느님 아버지의 뜻에 겸손하게 따르셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 눈같이 흰 장미 송이로 엮어 만든 이 꽃다발을 하느님 대전에서 겸손한 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '환희의 신비 2단',
      'subtitle': '마리아께서 엘리사벳을 찾아보심을 묵상합시다.',
      'content': '''어지신 어머니 마리아님, 어머니께서 엘리사벳을 방문하신 기쁨의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다. 어머니의 사촌 엘리사벳이 "당신은 여인들 가운데에서 가장 복되시며 당신 태중의 아기도 복되십니다" 라고 찬미의 인사를 드릴때, 어머니께서는 마니피캇을 읊어 답례하셨습니다.

이어서 주님의 기도, 성모송 (열 번), 영광송, 구원의 기도를 바칩니다.

저는 눈같이 흰 장미 송이로 엮어 만든 이 꽃다발을 하느님과 이웃을 사랑하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '환희의 신비 3단',
      'subtitle': '마리아께서 예수님을 낳으심을 묵상합시다.',
      'content': '''어지신 어머니 마리아님, 예수님께서 탄생하신 기쁨의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다. 거룩하신 동정 마리아님, 당신은 베들레헴 마구간에서 구세주를 낳으셨습니다. 그 때 "지극히 높은 곳에서는 하느님께 영광, 땅에서는 그분 마음에 드는 사람들에게 평화" 하고 천사들의 기꺼운 찬미의 노래는 하늘을 메우고 땅 끝까지 울려 퍼졌습니다.

이어서 주님의 기도, 성모송 (열 번), 영광송, 구원의 기도를 바칩니다.

저는 눈같이 흰 장미 송이로 엮어만든 이 꽃다발을 마음이 가난한 삶의 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '환희의 신비 4단',
      'subtitle': '마리아께서 예수님을 성전에 바치심을 묵상합시다.',
      'content': '''어지신 어머니 마리아님, 예수님을 성전에 바치신 기쁨의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
모세의 율법에 따라 예수님을 성전에 봉헌하러 갔을때, 예언자 시므온은 아기 예수님을 받아안고 구세주를 생전에 보게 해 주신 하느님께 감사하며, "당신의 영혼이 칼에 꿰찔리는 가운데, 많은 사람의 마음속 생각이 드러날 것입니다."라고 어머니께 다가올 고통을 예언하였습니다.

이어서 주님의 기도, 성모송 (열 번), 영광송, 구원의 기도를 바칩니다.

저는 눈같이 흰 장미 송이로 역어 만든 이 꽃다발을 정결한 마음가짐의 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '환희의 신비 5단',
      'subtitle': '마리아께서 잃으셨던 예수님을 성전에서 찾으심을 묵상합시다.',
      'content': '''어지신 어머니 마리아님, 예수님을 성전에서 찾으신 기쁨의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다. 어린 예수님을 잃으신 어머니께서는 슬픔에 잠겨 사흘이나 찾아 헤매시다가 마침내 성전에서 율법 교사들과 토론하고 계신 예수님을 찾으시고 기쁨에 넘치셨습니다. 그리고 어머니께서 원하시자 예수님께서는 순명하여 집으로 돌아오셨습니다.

이어서 주님의 기도, 성모송 (열 번), 영광송, 구원의 기도를 바칩니다.

저는 눈같이 흰 장미 송이로 역어 만든 이 꽃다발을 어머니 발아래 겸손히 바칩니다.''',
    },
  ];
}
