// 빛의 신비 기도문 데이터

class LuminousMysteries {
  static const String title = '빛의 신비';

  static const List<Map<String, String>> mysteries = [
    {
      'title': '빛의 신비 1단',
      'subtitle': '예수님께서 세례받으심을 묵상합시다.',
      'content': '''자애로우신 어머니 마리아님, 예수님께서 요르단강에서 세례를 받으신 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 죄를 모르는 분이시지만 요르단강에서 세례를 주던 요한을 찾아가 우리를 위하여 죄 있는 사람처럼 물속에 잠겨 세례를 받으셨습니다, 그러자 홀연히 하늘이 열리고 "이는 내가 사랑하는 아들, 내 마음에 드는 아들이다."라는 하느님 아버지의 음성이 들려왔고, 성령께서 비둘기 모양으로 내려와 예수님께서 수행해야 할 하느님 나라의 선포 사명을 계시하셨습니다.

이어서 주님의 기도, 성모송(열번), 영광송, 구원의 기도를 바칩니다.

저는 황금같이 빛나는 장미 송이로 엮어 만든 이 꽃다발을 하느님의 자녀로서 기쁘고 충실하게 살아갈 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '빛의 신비 2단',
      'subtitle': '예수님께서 가나에서 첫 기적을 행하심을 묵상합시다.',
      'content': '''자애로우신 어머니 마리아님, 예수님께서 카나의 혼인 잔치에서 어머니의 중개로 당신을 드러내신 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 혼인 잔치에 포도주가 떨어졌다고 알리신 어머니의 말씀에 "아직 저의 때가 오지 않았습니다."라고 하셨으나, 어머니께서 "무엇이든지 그가 시키는 대로 하여라."라고 이르신 대로 하인들이 행하자, 곧 물을 포도주로 변화시키시어 혼인 잔치를 풍요롭게 하셨습니다. 이렇게 예수님께서는 카나에서 첫 기적을 행하시어 당신의 영광을 드러내셨습니다.

이어서 주님의 기도, 성모송(열번), 영광송, 구원의 기도를 바칩니다.

저는 황금같이 빛나는 장미 송이로 엮어 만든 이 꽃다발을 예수님의 말씀에 따르는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '빛의 신비 3단',
      'subtitle': '예수님께서 하느님 나라를 선포하심을 묵상합시다.',
      'content': '''자애로우신 어머니 마리아님, 예수님께서 하느님의 나라를 선포하신 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 갈릴래아에서 하느님 나라의 기쁜 소식을 선포하시며 "때가 차서 하느님의 나라가 가까이 왔다. 회개하고 복음을 믿어라."하고 말씀하셨습니다. 그리고 겸손한 신뢰와 회개로 당신께 가까이 다가오는 모든 사람의 죄를 용서하시고 마귀를 쫓아내시며 그들의 병고를 치유해 주셨습니다.

이어서 주님의 기도, 성모송(열번), 영광송, 구원의 기도를 바칩니다.

저는 황금같이 빛나는 장미송이로 엮어 만든 이 꽃다발을 이웃에게 하느님 나라를 전하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '빛의 신비 4단',
      'subtitle': '예수님께서 거룩하게 변모하심을 묵상합시다.',
      'content': '''자애로우신 어머니 마리아님, 예수님께서 거룩하게 변모하신 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 베드로와 요한과 야고보만을 데리고 산으로 올라가 기도하시는 중에 얼굴 모습이 변하고 옷은 새하얗게 빛났습니다. 그리고 모세와 엘리야가 나타나 예수님께서 영광을 받으시기 전에 겪을 수난과 죽음에 대해 함께 이야기를 나누었습니다. 이때 구름 속에서 "이는 내가 선택한 아들이니 너희는 그의 말을 들어라."라는 소리가 들려와, 영광에 앞서 예수님과 함께 수난을 겪게 될 제자들을 준비시키셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 황금같이 빛나는 장미 송이로 엮어 만든 이 꽃다발을 영원한 생명을 위해 인내하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '빛의 신비 5단',
      'subtitle': '예수님께서 성체성사를 세우심을 묵상합시다.',
      'content': '''자애로우신 어머니 마리아님, 주님께서 성체성사를 세우신 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 최후의 만찬상에서 빵을 들어 축복하시고 "받아 먹어라, 이는 내 몸이다."라며 제자들에게 나누어 주시고, 잔을 들어 감사를 드리신 다음 "모두 이 잔을 마셔라, 이는 죄를 용서해 주려고 많은 사람을 위하여 흘리는 내 계약을 피다."라며 제자들에게 잔을 건네셨습니다., 주님께서는 인류 구원을 위해 당신을 성부께 봉헌하셨고 이 지극한 사랑을 성체성사로 증명하셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 황금같이 빛나는 장미 송이로 엮어 만든 이 꽃다발을 성체께 흠숭과 감사를 드리는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
  ];
}
