// 고통의 신비 기도문 데이터

class SorrowfulMysteries {
  static const String title = '고통의 신비';

  static const List<Map<String, String>> mysteries = [
    {
      'title': '고통의 신비 1단',
      'subtitle': '예수님께서 우리를 위하여 피땀 흘리심을 묵상합시다.',
      'content': '''지극히 고통스러우신 어머니 마리아님, 저희를 위하여 겟세마니 동산에서 피땀 흘리신 주님 사랑의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 당신이 당하실 고통과 죽음, 어머니께서 당하실 고통과 교회가 당할 고통 그리고 성체 안에서 당신이 당하실 고통을 미리 보시고는 피땀을 흘리시며 고뇌에 찬 목소리로 "아버지! 아버지께서는 무엇이든 하실 수 있으시니, 이 잔을 저에게서 거두어 주십시오, 그러나 제가 원하는 것을 하지 마시고 아버지께서 원하시는 것을 하십시오."라고 부르짖으며 하느님 아버지의 뜻에 따를 것을 원하셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 피같이 붉은 장미 송이로 엮어 만든 이 꽃다발을 하느님을 온전히 신뢰하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '고통의 신비 2단',
      'subtitle': '예수님께서 우리를 위하여 매 맞으심을 묵상합시다.',
      'content': '''지극히 고통스러우신 어머니 마리아님, 저희를 위하여 채찍질을 당하신 주님 사랑의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
빌라도가 명령을 내리자 군사들은 예수님의 옷을 벗기고 예수님을 기둥에 묶어 매질하였습니다. 그때 어머니의 거룩한 아드님께서는 머리에서 발끝까지, 온 몸이 잔인하게 찢어지고, 더 이상 견딜 수 없을 지경에 이르도록 살이 채찍에 묻어 떨어져 나왔습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 피같이 붉은 장미 송이로 엮어 만든 이 꽃다발을 하느님 나라를 위해 극기하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '고통의 신비 3단',
      'subtitle': '예수님께서 우리를 위하여 가시관 쓰심을 묵상합시다.',
      'content': '''지극히 고통스러우신 어머니 마리아님, 저희를 위하여 가시관 쓰신 주님 사랑의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
군사들이 주님의 머리 위에 날카로운 가시관을 씌우고 힘을 다해 누르니 가시가 머릿속 깊이 박혔습니다. 또한 그들은 주님앞에 무릎을 꿇고 "유다인들의 임금님, 만세!"하며 주님을 조롱하였습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 피같이 붉은 장미 송이로 엮어 만든 이 꽃다발을 양선하신 예수님을 닮을 수 있는 온유의 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '고통의 신비 4단',
      'subtitle': '예수님께서 우리를 위하여 십자가 지심을 묵상합시다.',
      'content': '''지극히 고통스러우신 어머니 마리아님, 저희를 위하여 십자가를 지신 주님 사랑의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
예수님께서는 몸소 십자가를 지시고 '해골 터'라는 곳으로 나가셨는데 무거운 십자 나무가 어깨를 짓눌러 걸음걸이가 흩어지고, 고통의 길은 험했습니다. 예수님께서는 군중들의 야유 속에서도 참고 견디시며 갈바리아 산으로 올라가셨는데, 비틀거리며 걸어가시다가 넘어지실 때마다 군사들의 잔악한 채찍은 고난의 길을 더욱 재촉했습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 피같은 붉은 장미 송이로 엮어 만든 이 꽃다발을 역경을 이겨내는 용덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
    {
      'title': '고통의 신비 5단',
      'subtitle': '예수님께서 우리를 위하여 십자가에 못 박혀 돌아가심을 묵상합시다.',
      'content': '''지극히 고통스러우신 어머니 마리아님, 저희를 위하여 십자가에 못 박혀 돌아가신 주님 사랑의 신비를 묵상하며 정성을 다해 이 기도를 바칩니다.
거룩하신 당신의 아들 예수님께서는 십자가에 못 박혀 세 시간 동안이나 말할 수 없는 극도의 고통에 시달리셨으나 당신을 적대하는 그들을 용서해 달라고 하느님 아버지께 간청하셨습니다. 그리고 당신의 영을 아버지 손에 온전히 맡기시며 숨을 거두셨습니다.

이어서 주님의 기도, 성모송(열 번), 영광송, 구원의 기도를 바칩니다.

저는 피같이 붉은 장미 송이로 엮어 만든 이 꽃다발을 원수를 용서하고 그를 위해 기도하는 덕을 구하며 어머니 발아래 겸손히 바칩니다.''',
    },
  ];
}
